Public Attributes | List of all members
API_RendImage Struct Reference
Rendering Scenes and Settings
The representation of the Rendering Settings / Size Background tab page. More...
#include <APIdefs_Environment.h>
 Public Attributes
 short  | hSize
Horizontal pixel size.
 short  | vSize
Vertical pixel size.
 short  | outResolution
Dots per inch resolution.
 bool  | proportional
Proportional change for hSize/vSize.
 bool  | bkgPict
Colors or picture background.
 API_RGBColor  | bkgSkyRGB
Sky color.
 API_RGBColor  | bkgEarthRGB
Earth color.
 API_Rect  | bkgPictRect
Background picture rectangle.
 IO::Location *  | bkgPictFile
Background picture file.
 short  | bkgResolution
Background resolution.
 bool  | partialRendering
Photorender only a part of the whole image. The rectangular shape is defined by the partialRect field.
 API_Rect  | partialRect
Rectangle for partial photorendering; valid only if the partialRendering field is true. The position of the rectangle is relative to the left-top corner of the whole image.
 short  | scaleType
its value can be 0 (ScaleType_ToFill), or 1 (ScaleType_ToFit)
short  | bkgScaleType
its value can be 0 (BKGScaleType_ToFit), 1 (BKGScaleType_ToFill), or 2 (BKGScaleType_Custom)
Detailed Description
The representation of the Rendering Settings / Size Background tab page.
Remarks
This structure is used by the ACAPI_Rendering_GetRenderingSets and ACAPI_Rendering_ChangeRenderingSets functions to get and modify the Size and Background "Rendering Settings" tab page. See an example of using this structure at the description of ACAPI_Rendering_ChangeRenderingSets.
Member Data Documentation
◆ bkgScaleType
 API_RendImage::bkgScaleType
its value can be 0 (BKGScaleType_ToFit), 1 (BKGScaleType_ToFill), or 2 (BKGScaleType_Custom)